      *
      * Field prefix exmaple
      *
      *          ------------------------------------------
     C*
     C     *ENTRY        PLIST
     C                   PARM                    P#STAT            5
      *
     C                   EVAL      P#STAT = 'END  '
     C                   dsply                   P#STAT
      *
     C                   SETON                                        LR
