      *$$\CRTOM CRTRPGPGM
      *$$ CVTOPT(*DATETIME *VARCHAR)
      *$$ REPLACE(*YES)
      *$$ TGTRLS(V5R2M0)
      *$$ USRPRF(*OWNER)
      *$$\ENDOM
      * ----------------------------------------------------------- *
      * Description  16-01-2013 09:09                               *
      * ----------------------------------------------------------- *
      *
      *
      *          ------------------------------------------
      *          API binaray parameter definition
      *          ------------------------------------------
      /COPY QAPILESRC,DEFTXT
      *
      *          ------------------------------------------
      *          Named constants
      *          ------------------------------------------
     D C#TERM          C                   CONST('*TERM')
     D C#NORM          C                   CONST('*NORM')
      * ----------------------------------------------------------- *
      /EJECT
      * ----------------------------------------------------------- *
      * Mainline                                                    *
      * ----------------------------------------------------------- *
      *
      *          ------------------------------------------
      *          Parameters
      *          ------------------------------------------
     C     *ENTRY        PLIST
     C                   PARM                    P#MSGD          256
      *
      *
      *          ------------------------------------------
      *          Return to caller.
      *          ------------------------------------------
     C                   RETURN
      * ----------------------------------------------------------- *
      /EJECT
      * ----------------------------------------------------------- *
      * *INZSR - Program initialisation                             *
      *                                                             *
      * ----------------------------------------------------------- *
     C     *INZSR        BEGSR
      *
      *          ------------------------------------------
      *          Indicator definition
      *          ------------------------------------------
     C                   MOVE      *BLANKS       I#LIND            1
      *
      *          ------------------------------------------
      *          End of subroutine
      *          ------------------------------------------
     C                   ENDSR
      * ------------------------------------------------------------ *
