     H*VARCHAR
      *$$\CRTOM CRTBNDRPG
      *$$ REPLACE(*YES)
      *$$ DBGVIEW(*SOURCE)
      *$$ TGTRLS(V5R4M0)
      *$$ USRPRF(*OWNER)
      *$$\ENDOM
      * ----------------------------------------------------------- *
      * Description                                                 *
      * ----------------------------------------------------------- *
      *  Test programmatje tbv DB2 sql                              *
      *                                                             *
      * ----------------------------------------------------------- *
      /EJECT
      * ----------------------------------------------------------- *
      * ----------------------------------------------------------- *
      * File specifications                                         *
      * ----------------------------------------------------------- *
     FTST6PF    IF   E           K DISK
      * ----------------------------------------------------------- *
      *
     C     *LOVAL        SETLL     TST6PF
     C                   READ      TST6PF
      *
     C                   IF        1=2
     C                   ENDIF
      *
     C                   READ      TST6PF
      *
     C                   SETON                                        LR
     C                   RETURN
      * ----------------------------------------------------------- *
      /EJECT
